src/geekbang-mysql-practice.org

#+title: MySQL实战45讲
#+options: num:nil

** [[https://time.geekbang.org/column/article/67888][开篇词 | 这一次，让我们一起来搞懂MySQL]]

开篇词 | 这一次，让我们一起来搞懂MySQL

** [[https://time.geekbang.org/column/article/68319][01 | 基础架构：一条SQL查询语句是如何执行的？]]

01 | 基础架构：一条SQL查询语句是如何执行的？

** [[https://time.geekbang.org/column/article/68633][02  | 日志系统：一条SQL更新语句是如何执行的？]]

02  | 日志系统：一条SQL更新语句是如何执行的？

** [[https://time.geekbang.org/column/article/68963][03 | 事务隔离：为什么你改了我还看不见？]]

03 | 事务隔离：为什么你改了我还看不见？

** [[https://time.geekbang.org/column/article/69236][04 | 深入浅出索引（上）]]

04 | 深入浅出索引（上）

** [[https://time.geekbang.org/column/article/69636][05 | 深入浅出索引（下）]]

05 | 深入浅出索引（下）

** [[https://time.geekbang.org/column/article/69862][06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？]]

06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？

** [[https://time.geekbang.org/column/article/70215][07 | 行锁功过：怎么减少行锁对性能的影响？]]

07 | 行锁功过：怎么减少行锁对性能的影响？

** [[https://time.geekbang.org/column/article/70562][08 | 事务到底是隔离的还是不隔离的？]]

08 | 事务到底是隔离的还是不隔离的？

** [[https://time.geekbang.org/column/article/70848][09 | 普通索引和唯一索引，应该怎么选择？]]

09 | 普通索引和唯一索引，应该怎么选择？

** [[https://time.geekbang.org/column/article/71173][10 | MySQL为什么有时候会选错索引？]]

10 | MySQL为什么有时候会选错索引？

** [[https://time.geekbang.org/column/article/71492][11 |  怎么给字符串字段加索引？]]

11 |  怎么给字符串字段加索引？

** [[https://time.geekbang.org/column/article/71806][12 | 为什么我的MySQL会“抖”一下？]]

12 | 为什么我的MySQL会“抖”一下？

** [[https://time.geekbang.org/column/article/72388][13 | 为什么表数据删掉一半，表文件大小不变？]]

13 | 为什么表数据删掉一半，表文件大小不变？

** [[https://time.geekbang.org/column/article/72775][14 | count(*)这么慢，我该怎么办？]]

14 | count(*)这么慢，我该怎么办？

** [[https://time.geekbang.org/column/article/73161][15 | 答疑文章（一）：日志和索引相关问题]]

15 | 答疑文章（一）：日志和索引相关问题

** [[https://time.geekbang.org/column/article/73479][16 | “order by”是怎么工作的？]]

16 | “order by”是怎么工作的？

** [[https://time.geekbang.org/column/article/73795][17 | 如何正确地显示随机消息？]]

17 | 如何正确地显示随机消息？

** [[https://time.geekbang.org/column/article/74059][18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？]]

18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？

** [[https://time.geekbang.org/column/article/74687][19 | 为什么我只查一行的语句，也执行这么慢？]]

19 | 为什么我只查一行的语句，也执行这么慢？

** [[https://time.geekbang.org/column/article/75173][20 | 幻读是什么，幻读有什么问题？]]

20 | 幻读是什么，幻读有什么问题？

** [[https://time.geekbang.org/column/article/75659][21 | 为什么我只改一行的语句，锁这么多？]]

21 | 为什么我只改一行的语句，锁这么多？

** [[https://time.geekbang.org/column/article/75746][22 | MySQL有哪些“饮鸩止渴”提高性能的方法？]]

22 | MySQL有哪些“饮鸩止渴”提高性能的方法？

** [[https://time.geekbang.org/column/article/76161][23 | MySQL是怎么保证数据不丢的？]]

23 | MySQL是怎么保证数据不丢的？

** [[https://time.geekbang.org/column/article/76446][24 | MySQL是怎么保证主备一致的？]]

24 | MySQL是怎么保证主备一致的？

** [[https://time.geekbang.org/column/article/76795][25 | MySQL是怎么保证高可用的？]]

25 | MySQL是怎么保证高可用的？

** [[https://time.geekbang.org/column/article/77083][26 | 备库为什么会延迟好几个小时？]]

26 | 备库为什么会延迟好几个小时？

** [[https://time.geekbang.org/column/article/77427][27 | 主库出问题了，从库怎么办？]]

27 | 主库出问题了，从库怎么办？

** [[https://time.geekbang.org/column/article/77636][28 | 读写分离有哪些坑？]]

28 | 读写分离有哪些坑？

** [[https://time.geekbang.org/column/article/78134][29 | 如何判断一个数据库是不是出问题了？]]

29 | 如何判断一个数据库是不是出问题了？

** [[https://time.geekbang.org/column/article/78427][30 | 答疑文章（二）：用动态的观点看加锁]]

30 | 答疑文章（二）：用动态的观点看加锁

** [[https://time.geekbang.org/column/article/78658][31 | 误删数据后除了跑路，还能怎么办？]]

31 | 误删数据后除了跑路，还能怎么办？

** [[https://time.geekbang.org/column/article/79026][32 | 为什么还有kill不掉的语句？]]

32 | 为什么还有kill不掉的语句？

** [[https://time.geekbang.org/column/article/79407][33 | 我查这么多数据，会不会把数据库内存打爆？]]

33 | 我查这么多数据，会不会把数据库内存打爆？

** [[https://time.geekbang.org/column/article/79700][34 | 到底可不可以使用join？]]

34 | 到底可不可以使用join？

** [[https://time.geekbang.org/column/article/80147][35 | join语句怎么优化？]]

35 | join语句怎么优化？

** [[https://time.geekbang.org/column/article/80449][36 | 为什么临时表可以重名？]]

36 | 为什么临时表可以重名？

** [[https://time.geekbang.org/column/article/80477][37 | 什么时候会使用内部临时表？]]

37 | 什么时候会使用内部临时表？

** [[https://time.geekbang.org/column/article/80495][38 | 都说InnoDB好，那还要不要使用Memory引擎？]]

38 | 都说InnoDB好，那还要不要使用Memory引擎？

** [[https://time.geekbang.org/column/article/80531][39 | 自增主键为什么不是连续的？]]

39 | 自增主键为什么不是连续的？

** [[https://time.geekbang.org/column/article/80801][40 | insert语句的锁为什么这么多？]]

40 | insert语句的锁为什么这么多？

** [[https://time.geekbang.org/column/article/81925][41 | 怎么最快地复制一张表？]]

41 | 怎么最快地复制一张表？

** [[https://time.geekbang.org/column/article/82231][42 | grant之后要跟着flush privileges吗？]]

42 | grant之后要跟着flush privileges吗？

** [[https://time.geekbang.org/column/article/82560][43 | 要不要使用分区表？]]

43 | 要不要使用分区表？

** [[https://time.geekbang.org/column/article/82865][44 | 答疑文章（三）：说一说这些好问题]]

44 | 答疑文章（三）：说一说这些好问题

** [[https://time.geekbang.org/column/article/83183][45 | 自增id用完怎么办？]]

45 | 自增id用完怎么办？

** [[https://time.geekbang.org/column/article/73370][直播回顾 | 林晓斌：我的 MySQL 心路历程]]

直播回顾 | 林晓斌：我的 MySQL 心路历程

** [[https://time.geekbang.org/column/article/83556][结束语 | 点线网面，一起构建MySQL知识网络]]

结束语 | 点线网面，一起构建MySQL知识网络
