html/geekbang-mysql-practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL实战45讲</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">MySQL实战45讲</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbd8df36">开篇词 | 这一次，让我们一起来搞懂MySQL</a></li>
<li><a href="#org09b97e9">01 | 基础架构：一条SQL查询语句是如何执行的？</a></li>
<li><a href="#org7bc516a">02  | 日志系统：一条SQL更新语句是如何执行的？</a></li>
<li><a href="#orgc7cca3e">03 | 事务隔离：为什么你改了我还看不见？</a></li>
<li><a href="#orgf7cda59">04 | 深入浅出索引（上）</a></li>
<li><a href="#org78e28d0">05 | 深入浅出索引（下）</a></li>
<li><a href="#org0d9e141">06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？</a></li>
<li><a href="#org8b12710">07 | 行锁功过：怎么减少行锁对性能的影响？</a></li>
<li><a href="#org08ead02">08 | 事务到底是隔离的还是不隔离的？</a></li>
<li><a href="#org55d3111">09 | 普通索引和唯一索引，应该怎么选择？</a></li>
<li><a href="#org523cfb0">10 | MySQL为什么有时候会选错索引？</a></li>
<li><a href="#orgf219bad">11 |  怎么给字符串字段加索引？</a></li>
<li><a href="#org4f52cc9">12 | 为什么我的MySQL会“抖”一下？</a></li>
<li><a href="#orgc81ad6f">13 | 为什么表数据删掉一半，表文件大小不变？</a></li>
<li><a href="#org0d06f72">14 | count(*)这么慢，我该怎么办？</a></li>
<li><a href="#org5b32333">15 | 答疑文章（一）：日志和索引相关问题</a></li>
<li><a href="#org63ef1b5">16 | “order by”是怎么工作的？</a></li>
<li><a href="#org0063ae4">17 | 如何正确地显示随机消息？</a></li>
<li><a href="#orgbb1c560">18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？</a></li>
<li><a href="#orgb625572">19 | 为什么我只查一行的语句，也执行这么慢？</a></li>
<li><a href="#org06eb39f">20 | 幻读是什么，幻读有什么问题？</a></li>
<li><a href="#org49acb52">21 | 为什么我只改一行的语句，锁这么多？</a></li>
<li><a href="#orga9d0622">22 | MySQL有哪些“饮鸩止渴”提高性能的方法？</a></li>
<li><a href="#org06dbc47">23 | MySQL是怎么保证数据不丢的？</a></li>
<li><a href="#orge55b515">24 | MySQL是怎么保证主备一致的？</a></li>
<li><a href="#orgd983695">25 | MySQL是怎么保证高可用的？</a></li>
<li><a href="#org56fae84">26 | 备库为什么会延迟好几个小时？</a></li>
<li><a href="#org0635193">27 | 主库出问题了，从库怎么办？</a></li>
<li><a href="#org9a17041">28 | 读写分离有哪些坑？</a></li>
<li><a href="#org4cfb171">29 | 如何判断一个数据库是不是出问题了？</a></li>
<li><a href="#orga22bae2">30 | 答疑文章（二）：用动态的观点看加锁</a></li>
<li><a href="#org3e878d0">31 | 误删数据后除了跑路，还能怎么办？</a></li>
<li><a href="#org26a6a09">32 | 为什么还有kill不掉的语句？</a></li>
<li><a href="#orgddefce3">33 | 我查这么多数据，会不会把数据库内存打爆？</a></li>
<li><a href="#org278d0ce">34 | 到底可不可以使用join？</a></li>
<li><a href="#orga5e2f00">35 | join语句怎么优化？</a></li>
<li><a href="#org82c2c36">36 | 为什么临时表可以重名？</a></li>
<li><a href="#org27b1a10">37 | 什么时候会使用内部临时表？</a></li>
<li><a href="#orga5a9fdc">38 | 都说InnoDB好，那还要不要使用Memory引擎？</a></li>
<li><a href="#orgb588dd2">39 | 自增主键为什么不是连续的？</a></li>
<li><a href="#orgb3aef89">40 | insert语句的锁为什么这么多？</a></li>
<li><a href="#org8dd7b4d">41 | 怎么最快地复制一张表？</a></li>
<li><a href="#orgf28f8ab">42 | grant之后要跟着flush privileges吗？</a></li>
<li><a href="#org36f1dba">43 | 要不要使用分区表？</a></li>
<li><a href="#orge806110">44 | 答疑文章（三）：说一说这些好问题</a></li>
<li><a href="#orgb3a7e3b">45 | 自增id用完怎么办？</a></li>
<li><a href="#orgf435d79">直播回顾 | 林晓斌：我的 MySQL 心路历程</a></li>
<li><a href="#orgc5a0521">结束语 | 点线网面，一起构建MySQL知识网络</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbd8df36" class="outline-2">
<h2 id="orgbd8df36"><a href="https://time.geekbang.org/column/article/67888">开篇词 | 这一次，让我们一起来搞懂MySQL</a></h2>
<div class="outline-text-2" id="text-orgbd8df36">
<p>
开篇词 | 这一次，让我们一起来搞懂MySQL
</p>
</div>
</div>

<div id="outline-container-org09b97e9" class="outline-2">
<h2 id="org09b97e9"><a href="https://time.geekbang.org/column/article/68319">01 | 基础架构：一条SQL查询语句是如何执行的？</a></h2>
<div class="outline-text-2" id="text-org09b97e9">
<p>
01 | 基础架构：一条SQL查询语句是如何执行的？
</p>
</div>
</div>

<div id="outline-container-org7bc516a" class="outline-2">
<h2 id="org7bc516a"><a href="https://time.geekbang.org/column/article/68633">02  | 日志系统：一条SQL更新语句是如何执行的？</a></h2>
<div class="outline-text-2" id="text-org7bc516a">
<p>
02  | 日志系统：一条SQL更新语句是如何执行的？
</p>
</div>
</div>

<div id="outline-container-orgc7cca3e" class="outline-2">
<h2 id="orgc7cca3e"><a href="https://time.geekbang.org/column/article/68963">03 | 事务隔离：为什么你改了我还看不见？</a></h2>
<div class="outline-text-2" id="text-orgc7cca3e">
<p>
03 | 事务隔离：为什么你改了我还看不见？
</p>
</div>
</div>

<div id="outline-container-orgf7cda59" class="outline-2">
<h2 id="orgf7cda59"><a href="https://time.geekbang.org/column/article/69236">04 | 深入浅出索引（上）</a></h2>
<div class="outline-text-2" id="text-orgf7cda59">
<p>
04 | 深入浅出索引（上）
</p>
</div>
</div>

<div id="outline-container-org78e28d0" class="outline-2">
<h2 id="org78e28d0"><a href="https://time.geekbang.org/column/article/69636">05 | 深入浅出索引（下）</a></h2>
<div class="outline-text-2" id="text-org78e28d0">
<p>
05 | 深入浅出索引（下）
</p>
</div>
</div>

<div id="outline-container-org0d9e141" class="outline-2">
<h2 id="org0d9e141"><a href="https://time.geekbang.org/column/article/69862">06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？</a></h2>
<div class="outline-text-2" id="text-org0d9e141">
<p>
06 | 全局锁和表锁 ：给表加个字段怎么有这么多阻碍？
</p>
</div>
</div>

<div id="outline-container-org8b12710" class="outline-2">
<h2 id="org8b12710"><a href="https://time.geekbang.org/column/article/70215">07 | 行锁功过：怎么减少行锁对性能的影响？</a></h2>
<div class="outline-text-2" id="text-org8b12710">
<p>
07 | 行锁功过：怎么减少行锁对性能的影响？
</p>
</div>
</div>

<div id="outline-container-org08ead02" class="outline-2">
<h2 id="org08ead02"><a href="https://time.geekbang.org/column/article/70562">08 | 事务到底是隔离的还是不隔离的？</a></h2>
<div class="outline-text-2" id="text-org08ead02">
<p>
08 | 事务到底是隔离的还是不隔离的？
</p>
</div>
</div>

<div id="outline-container-org55d3111" class="outline-2">
<h2 id="org55d3111"><a href="https://time.geekbang.org/column/article/70848">09 | 普通索引和唯一索引，应该怎么选择？</a></h2>
<div class="outline-text-2" id="text-org55d3111">
<p>
09 | 普通索引和唯一索引，应该怎么选择？
</p>
</div>
</div>

<div id="outline-container-org523cfb0" class="outline-2">
<h2 id="org523cfb0"><a href="https://time.geekbang.org/column/article/71173">10 | MySQL为什么有时候会选错索引？</a></h2>
<div class="outline-text-2" id="text-org523cfb0">
<p>
10 | MySQL为什么有时候会选错索引？
</p>
</div>
</div>

<div id="outline-container-orgf219bad" class="outline-2">
<h2 id="orgf219bad"><a href="https://time.geekbang.org/column/article/71492">11 |  怎么给字符串字段加索引？</a></h2>
<div class="outline-text-2" id="text-orgf219bad">
<p>
11 |  怎么给字符串字段加索引？
</p>
</div>
</div>

<div id="outline-container-org4f52cc9" class="outline-2">
<h2 id="org4f52cc9"><a href="https://time.geekbang.org/column/article/71806">12 | 为什么我的MySQL会“抖”一下？</a></h2>
<div class="outline-text-2" id="text-org4f52cc9">
<p>
12 | 为什么我的MySQL会“抖”一下？
</p>
</div>
</div>

<div id="outline-container-orgc81ad6f" class="outline-2">
<h2 id="orgc81ad6f"><a href="https://time.geekbang.org/column/article/72388">13 | 为什么表数据删掉一半，表文件大小不变？</a></h2>
<div class="outline-text-2" id="text-orgc81ad6f">
<p>
13 | 为什么表数据删掉一半，表文件大小不变？
</p>
</div>
</div>

<div id="outline-container-org0d06f72" class="outline-2">
<h2 id="org0d06f72"><a href="https://time.geekbang.org/column/article/72775">14 | count(*)这么慢，我该怎么办？</a></h2>
<div class="outline-text-2" id="text-org0d06f72">
<p>
14 | count(*)这么慢，我该怎么办？
</p>
</div>
</div>

<div id="outline-container-org5b32333" class="outline-2">
<h2 id="org5b32333"><a href="https://time.geekbang.org/column/article/73161">15 | 答疑文章（一）：日志和索引相关问题</a></h2>
<div class="outline-text-2" id="text-org5b32333">
<p>
15 | 答疑文章（一）：日志和索引相关问题
</p>
</div>
</div>

<div id="outline-container-org63ef1b5" class="outline-2">
<h2 id="org63ef1b5"><a href="https://time.geekbang.org/column/article/73479">16 | “order by”是怎么工作的？</a></h2>
<div class="outline-text-2" id="text-org63ef1b5">
<p>
16 | “order by”是怎么工作的？
</p>
</div>
</div>

<div id="outline-container-org0063ae4" class="outline-2">
<h2 id="org0063ae4"><a href="https://time.geekbang.org/column/article/73795">17 | 如何正确地显示随机消息？</a></h2>
<div class="outline-text-2" id="text-org0063ae4">
<p>
17 | 如何正确地显示随机消息？
</p>
</div>
</div>

<div id="outline-container-orgbb1c560" class="outline-2">
<h2 id="orgbb1c560"><a href="https://time.geekbang.org/column/article/74059">18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？</a></h2>
<div class="outline-text-2" id="text-orgbb1c560">
<p>
18 | 为什么这些SQL语句逻辑相同，性能却差异巨大？
</p>
</div>
</div>

<div id="outline-container-orgb625572" class="outline-2">
<h2 id="orgb625572"><a href="https://time.geekbang.org/column/article/74687">19 | 为什么我只查一行的语句，也执行这么慢？</a></h2>
<div class="outline-text-2" id="text-orgb625572">
<p>
19 | 为什么我只查一行的语句，也执行这么慢？
</p>
</div>
</div>

<div id="outline-container-org06eb39f" class="outline-2">
<h2 id="org06eb39f"><a href="https://time.geekbang.org/column/article/75173">20 | 幻读是什么，幻读有什么问题？</a></h2>
<div class="outline-text-2" id="text-org06eb39f">
<p>
20 | 幻读是什么，幻读有什么问题？
</p>
</div>
</div>

<div id="outline-container-org49acb52" class="outline-2">
<h2 id="org49acb52"><a href="https://time.geekbang.org/column/article/75659">21 | 为什么我只改一行的语句，锁这么多？</a></h2>
<div class="outline-text-2" id="text-org49acb52">
<p>
21 | 为什么我只改一行的语句，锁这么多？
</p>
</div>
</div>

<div id="outline-container-orga9d0622" class="outline-2">
<h2 id="orga9d0622"><a href="https://time.geekbang.org/column/article/75746">22 | MySQL有哪些“饮鸩止渴”提高性能的方法？</a></h2>
<div class="outline-text-2" id="text-orga9d0622">
<p>
22 | MySQL有哪些“饮鸩止渴”提高性能的方法？
</p>
</div>
</div>

<div id="outline-container-org06dbc47" class="outline-2">
<h2 id="org06dbc47"><a href="https://time.geekbang.org/column/article/76161">23 | MySQL是怎么保证数据不丢的？</a></h2>
<div class="outline-text-2" id="text-org06dbc47">
<p>
23 | MySQL是怎么保证数据不丢的？
</p>
</div>
</div>

<div id="outline-container-orge55b515" class="outline-2">
<h2 id="orge55b515"><a href="https://time.geekbang.org/column/article/76446">24 | MySQL是怎么保证主备一致的？</a></h2>
<div class="outline-text-2" id="text-orge55b515">
<p>
24 | MySQL是怎么保证主备一致的？
</p>
</div>
</div>

<div id="outline-container-orgd983695" class="outline-2">
<h2 id="orgd983695"><a href="https://time.geekbang.org/column/article/76795">25 | MySQL是怎么保证高可用的？</a></h2>
<div class="outline-text-2" id="text-orgd983695">
<p>
25 | MySQL是怎么保证高可用的？
</p>
</div>
</div>

<div id="outline-container-org56fae84" class="outline-2">
<h2 id="org56fae84"><a href="https://time.geekbang.org/column/article/77083">26 | 备库为什么会延迟好几个小时？</a></h2>
<div class="outline-text-2" id="text-org56fae84">
<p>
26 | 备库为什么会延迟好几个小时？
</p>
</div>
</div>

<div id="outline-container-org0635193" class="outline-2">
<h2 id="org0635193"><a href="https://time.geekbang.org/column/article/77427">27 | 主库出问题了，从库怎么办？</a></h2>
<div class="outline-text-2" id="text-org0635193">
<p>
27 | 主库出问题了，从库怎么办？
</p>
</div>
</div>

<div id="outline-container-org9a17041" class="outline-2">
<h2 id="org9a17041"><a href="https://time.geekbang.org/column/article/77636">28 | 读写分离有哪些坑？</a></h2>
<div class="outline-text-2" id="text-org9a17041">
<p>
28 | 读写分离有哪些坑？
</p>
</div>
</div>

<div id="outline-container-org4cfb171" class="outline-2">
<h2 id="org4cfb171"><a href="https://time.geekbang.org/column/article/78134">29 | 如何判断一个数据库是不是出问题了？</a></h2>
<div class="outline-text-2" id="text-org4cfb171">
<p>
29 | 如何判断一个数据库是不是出问题了？
</p>
</div>
</div>

<div id="outline-container-orga22bae2" class="outline-2">
<h2 id="orga22bae2"><a href="https://time.geekbang.org/column/article/78427">30 | 答疑文章（二）：用动态的观点看加锁</a></h2>
<div class="outline-text-2" id="text-orga22bae2">
<p>
30 | 答疑文章（二）：用动态的观点看加锁
</p>
</div>
</div>

<div id="outline-container-org3e878d0" class="outline-2">
<h2 id="org3e878d0"><a href="https://time.geekbang.org/column/article/78658">31 | 误删数据后除了跑路，还能怎么办？</a></h2>
<div class="outline-text-2" id="text-org3e878d0">
<p>
31 | 误删数据后除了跑路，还能怎么办？
</p>
</div>
</div>

<div id="outline-container-org26a6a09" class="outline-2">
<h2 id="org26a6a09"><a href="https://time.geekbang.org/column/article/79026">32 | 为什么还有kill不掉的语句？</a></h2>
<div class="outline-text-2" id="text-org26a6a09">
<p>
32 | 为什么还有kill不掉的语句？
</p>
</div>
</div>

<div id="outline-container-orgddefce3" class="outline-2">
<h2 id="orgddefce3"><a href="https://time.geekbang.org/column/article/79407">33 | 我查这么多数据，会不会把数据库内存打爆？</a></h2>
<div class="outline-text-2" id="text-orgddefce3">
<p>
33 | 我查这么多数据，会不会把数据库内存打爆？
</p>
</div>
</div>

<div id="outline-container-org278d0ce" class="outline-2">
<h2 id="org278d0ce"><a href="https://time.geekbang.org/column/article/79700">34 | 到底可不可以使用join？</a></h2>
<div class="outline-text-2" id="text-org278d0ce">
<p>
34 | 到底可不可以使用join？
</p>
</div>
</div>

<div id="outline-container-orga5e2f00" class="outline-2">
<h2 id="orga5e2f00"><a href="https://time.geekbang.org/column/article/80147">35 | join语句怎么优化？</a></h2>
<div class="outline-text-2" id="text-orga5e2f00">
<p>
35 | join语句怎么优化？
</p>
</div>
</div>

<div id="outline-container-org82c2c36" class="outline-2">
<h2 id="org82c2c36"><a href="https://time.geekbang.org/column/article/80449">36 | 为什么临时表可以重名？</a></h2>
<div class="outline-text-2" id="text-org82c2c36">
<p>
36 | 为什么临时表可以重名？
</p>
</div>
</div>

<div id="outline-container-org27b1a10" class="outline-2">
<h2 id="org27b1a10"><a href="https://time.geekbang.org/column/article/80477">37 | 什么时候会使用内部临时表？</a></h2>
<div class="outline-text-2" id="text-org27b1a10">
<p>
37 | 什么时候会使用内部临时表？
</p>
</div>
</div>

<div id="outline-container-orga5a9fdc" class="outline-2">
<h2 id="orga5a9fdc"><a href="https://time.geekbang.org/column/article/80495">38 | 都说InnoDB好，那还要不要使用Memory引擎？</a></h2>
<div class="outline-text-2" id="text-orga5a9fdc">
<p>
38 | 都说InnoDB好，那还要不要使用Memory引擎？
</p>
</div>
</div>

<div id="outline-container-orgb588dd2" class="outline-2">
<h2 id="orgb588dd2"><a href="https://time.geekbang.org/column/article/80531">39 | 自增主键为什么不是连续的？</a></h2>
<div class="outline-text-2" id="text-orgb588dd2">
<p>
39 | 自增主键为什么不是连续的？
</p>
</div>
</div>

<div id="outline-container-orgb3aef89" class="outline-2">
<h2 id="orgb3aef89"><a href="https://time.geekbang.org/column/article/80801">40 | insert语句的锁为什么这么多？</a></h2>
<div class="outline-text-2" id="text-orgb3aef89">
<p>
40 | insert语句的锁为什么这么多？
</p>
</div>
</div>

<div id="outline-container-org8dd7b4d" class="outline-2">
<h2 id="org8dd7b4d"><a href="https://time.geekbang.org/column/article/81925">41 | 怎么最快地复制一张表？</a></h2>
<div class="outline-text-2" id="text-org8dd7b4d">
<p>
41 | 怎么最快地复制一张表？
</p>
</div>
</div>

<div id="outline-container-orgf28f8ab" class="outline-2">
<h2 id="orgf28f8ab"><a href="https://time.geekbang.org/column/article/82231">42 | grant之后要跟着flush privileges吗？</a></h2>
<div class="outline-text-2" id="text-orgf28f8ab">
<p>
42 | grant之后要跟着flush privileges吗？
</p>
</div>
</div>

<div id="outline-container-org36f1dba" class="outline-2">
<h2 id="org36f1dba"><a href="https://time.geekbang.org/column/article/82560">43 | 要不要使用分区表？</a></h2>
<div class="outline-text-2" id="text-org36f1dba">
<p>
43 | 要不要使用分区表？
</p>
</div>
</div>

<div id="outline-container-orge806110" class="outline-2">
<h2 id="orge806110"><a href="https://time.geekbang.org/column/article/82865">44 | 答疑文章（三）：说一说这些好问题</a></h2>
<div class="outline-text-2" id="text-orge806110">
<p>
44 | 答疑文章（三）：说一说这些好问题
</p>
</div>
</div>

<div id="outline-container-orgb3a7e3b" class="outline-2">
<h2 id="orgb3a7e3b"><a href="https://time.geekbang.org/column/article/83183">45 | 自增id用完怎么办？</a></h2>
<div class="outline-text-2" id="text-orgb3a7e3b">
<p>
45 | 自增id用完怎么办？
</p>
</div>
</div>

<div id="outline-container-orgf435d79" class="outline-2">
<h2 id="orgf435d79"><a href="https://time.geekbang.org/column/article/73370">直播回顾 | 林晓斌：我的 MySQL 心路历程</a></h2>
<div class="outline-text-2" id="text-orgf435d79">
<p>
直播回顾 | 林晓斌：我的 MySQL 心路历程
</p>
</div>
</div>

<div id="outline-container-orgc5a0521" class="outline-2">
<h2 id="orgc5a0521"><a href="https://time.geekbang.org/column/article/83556">结束语 | 点线网面，一起构建MySQL知识网络</a></h2>
<div class="outline-text-2" id="text-orgc5a0521">
<p>
结束语 | 点线网面，一起构建MySQL知识网络
</p>
</div>
</div>
</div>
</body>
</html>
